---
kind: method
id: M:Autodesk.Revit.DB.FormArray.Clear
source: html/acaf3bb9-6d94-fb42-6465-e4aaad9cbfc2.htm
---
# Autodesk.Revit.DB.FormArray.Clear Method

Removes every form from the array, rendering it empty.

## Syntax (C#)
```csharp
public virtual void Clear()
```